app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "facebook"], ["url", "facebook.com"], ["created_at", 2016-12-06 04:35:23 UTC], ["updated_at", 2016-12-06 04:35:23 UTC], ["user_id", 1]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["title", "Twitter"], ["url", "https://twitter.com/?lang=en"], ["updated_at", 2016-12-07 01:34:28 UTC], ["id", 3]]